[
    {
        "id": 0,
        "name": "Seagate Portable 2TB External Hard Drive Portable HDD ",
        "shortDescription": "Easily store and access 2TB of content on the go with the Seagate Portable Drive, a great laptop hard drive. Designed to work with Windows or Mac computers, this compact external hard drive makes backup a snap. Just drag and drop To get set up, connect the portable hard drive to a computer for automatic recognition—no software required—and enjoy plug and play simplicity with the included 18 inch USB 3.0 cable",
        "description": "Easily store and access 2TB to content on the go with the Seagate Portable Drive, a USB external hard drive Designed to work with Windows or Mac computers, this external hard drive makes backup a snap just drag and drop To get set up, connect the portable hard drive to a computer for automatic recognition no software required This USB drive provides plug and play simplicity with the included 18 inch USB 3.0 cable",
        "department": 0,
        "imgRef": "/api/images/?id=seagate.jpg",
        "productUrl": "/products/?id=0",
        "price": 59.99,
        "itemsInStock": 10,
        "cost": 26.08,
        "sale": false,
        "reduction": 0
    },
    {
        "id": 1,
        "name": "Sceptre E248W-19203R 24\" Ultra Thin 75Hz 1080p LED Monitor ",
        "shortDescription": "Whether you are a gamer or a movie buff, the Sceptre E248W-19203R monitor is the way to go. 1080P resolution (1920 x 1080 pixels) delivers stunning color and picture detail on a 22 inch screen. A 5 millisecond response time displays action sequences with the highest Degree of clarity. Enjoy HDMI, and VGA inputs to connect all video and gaming devices. Lamp Life 50,000+ Hours. The brightness level is 250 cd/m2 ans the viewing angle is 175 degree (horizontal and vertical).Colors : 16.7M (6-bit Hi-FRC).Contrast Ratio:1000 : 1",
        "description": "24\" Ultra slim profile Contemporary sleek metallic design Slim bezel with thin chassis.Power Range(V, A, Hz) - AC - DC Adapter Input 100 – 240 VAC, 50 / 60 Hz, 1.0A(Max.) Output - 12V DC, 2.5A.Power Consumption(Typical) - 25.4W.Neck / Stand Detachable: Yes 2 x HDMI Ports(convertible to DVI).Contrast Ratio:1000 : 1 VESA wall mount ready.HDMI Input Signal Support - 1920 x 1080 @ 75Hz, 1080 / 60p, 1080 / 60i, 720p, 480p, 480i, Built -in Speakers - 2 x 2W 8 Ohm.Mounting type: VESA Hole Pattern 100mm x 100mm",
        "department": 0,
        "imgRef": "/api/images/?id=Sceptre.jpg",
        "productUrl": "/products/?id=1",
        "price": 139.97,
        "itemsInStock": 10,
        "cost": 60.86,
        "sale": true,
        "reduction": 0.25
    },
    {
        "id": 2,
        "name": "2021 Apple 11-inch iPad Pro (Wi-Fi, 128GB) - Space Gray",
        "shortDescription": "Apple M1 chip for next - level performance Stunning 11 - inch Liquid Retina display with ProMotion",
        "description": "Apple M1 chip for next - level performance Stunning 11 - inch Liquid Retina display with ProMotion, True Tone, and P3 wide color TrueDepth camera system featuring Ultra Wide front camera with Center Stage 12MP Wide camera, 10MP Ultra Wide camera, and LiDAR Scanner for immersive AR Stay connected with ultrafast Wi - Fi Go further with all - day battery life Thunderbolt port for connecting to fast external storage, displays, and docks Face ID for secure authentication and Apple Pay Four speaker audio and five studio - quality microphones Support for Apple Pencil (2nd generation), Magic Keyboard, and Smart Keyboard Folio",
        "department": 0,
        "imgRef": "/api/images/?id=Apple-iPadPro.jpg",
        "productUrl": "/products/?id=2",
        "price": 759.99,
        "itemsInStock": 10,
        "cost": 330.00,
        "sale": false,
        "reduction": 0
    },
    {
        "id": 3,
        "name": "WD 2TB Elements Portable External Hard Drive HDD",
        "shortDescription": "Connect this portable drive to your PC for an instant storage upgrade. WD Elements is the ideal companion for taking important files with you on the go. ",
        "description": " USB 3.0 and USB 2.0 Compatibility Fast data transfers Improve PC Performance High Capacity; Compatibility Formatted NTFS for Windows 10, Windows 8.1, Windows 7; Reformatting may be required for other operating systems; Compatibility may vary depending on user’s hardware configuration and operating system ",
        "department": 0,
        "imgRef": "/api/images/?id=WD2TB.jpg",
        "productUrl": "/products/?id=3",
        "price": 59.99,
        "itemsInStock": 10,
        "cost": 26.08,
        "sale": true,
        "reduction": 0.25
    },
    {
        "id": 4,
        "name": "DUODUOGO 5G WiFi 2 in 1 Tablet",
        "shortDescription": " DUODUOGO T30 Tablet 10 inch built-in 5G&2.4G Dual WiFi, comes with a 3GB RAM and an Quad - Core processor up to 1.6GHz, enables quicker app launch, smoother videos and better overall performance. This tablet also supports downloading applications from Google play and is equipped with the latest Android 10.0 operating syste, responding quickly according to your instructions. ",
        "description": "👍[Android 10.0 Tablet] Equipped with Android 10.0 operating syste, 4-core processor, The main frequency is 1.6GHz, Can easily run large-scale online games, Make games and videos run smoothly. The USB Type C Port and 5G WIFI presents you with faster transmission speeds.With 6000mAh built-in rechargeable battery, It can be used for 5 to 8 hours during the journey. ✅【5G + 2.4G dual - band WiFi】Supporting 5G / 2.4G Dual WiFi connection can make your life more interesting! Connect to 5G wifi, you can quickly access web pages, download APP, and watch movies. 2.4G WIFI signal is relatively stable. You can switch WiFi freely.But Can't installation SIM.This version has passed GMS certification, You can download your favorite apps directly on Google Play. ▶ 【4GB RAM +64GB ROM】 This tablet features a 10.1 inch IPS display, tablet has 4GB of running memory, It runs very smoothly,Has 64GB of internal storage space(MicroSD can be expanded to 128GB), The tablet is equipped with a wireless mouse and bluetooth keyboard and other devices, which is an excellent assistant for learning and working online.Is a good choice for gifts. ★【Dual Camera and HD IPS Display】Take photos and videos with the front 5.0 MP and rear 8.0 MP cameras.It lets you conveniently take pictures and share them with friends and family.The 10.1 - inch tablet uses a 1280 * 800 full HD IPS display with vivid colors and improved viewing angle.You can enjoy immersive reading on the large - screen display, and use eye protection mode to watch comfortably at night. ❤【One - year warranty & 9 Accessories】 DUODUOGO has a professional after - sales team for customers, provide reliable customer service(one - year non - human damage warranty service).The packing list: 1 x Tablet PC, 1 x Leather Case, 1x Keyboard, 1x Mouse, 1x OTG Adapter, 1x Stylus, 1 x Type - C Data Cable, 1 x Charger, 1 x Manual.If you have any problems, contact us, we are committed to making you satisfied. ",
        "department": 0,
        "imgRef": "/api/images/?id=DUODUOGO.jpg",
        "productUrl": "/products/?id=4",
        "price": 144.55,
        "itemsInStock": 10,
        "cost": 62.85,
        "sale": false,
        "reduction": 0
    },
    {
        "id": 5,
        "name": "Acer Aspire 5 A515-46-R14K",
        "shortDescription": "Powerful and portable, the Aspire 5 laptop delivers on every aspect of everyday computing. Housing the AMD Ryzen 7 3700U Mobile Processor, this Aspire 5 can tackle any job no matter how complex. Creativity soars to new heights with sharp, crisp visuals showcased on the 15.6\" Full HD IPS screen, while the thin bezel provides you more space to work with wherever inspiration strikes. It’s the perfect companion to take with you wherever you go! ",
        "description": "     Powerful Productivity: AMD Ryzen 3 3350U delivers desktop-class performance and amazing battery life in a slim notebook. With Precision Boost, get up to 3.5GHz for your high-demand applications Maximized Visuals: See even more on the stunning 15.6\" Full HD display with 82.58% screen-to-body, 16:9 aspect ratio and narrow bezels Backlit Keyboard and Fingerprint Reader: Biometric fingerprint reader and Windows Hello sign -in options help keep your Acer PC secure Internal Specifications: 4GB DDR4 on - board memory(1 slot available); 128GB NVMe solid - state drive storage(1 hard drive bay available) to store your files and media Acer's Purified.Voice technology, features enhanced digital signal processing to cancel out background noise, improve speech accuracy and far-field pickup, which not only makes calls clearer, but makes talking to Alexa easier than before. Using Alexa on your PC is as easy as asking a question. Just ask and Alexa can check your calendar, create lists, play music, answer questions, read the news and more. Secure Operating System: Windows 10 Home(S mode) comes with advanced security features built right in, like protections against phishing and malicious software so you don't have to think twice when navigating to a new webpage or downloading an app Connections: 802.11ax Wi-Fi 6 Dual - Band 2.4GHz and 5GHz featuring MU - MIMO technology; 10 100 1000 Gigabit Ethernet LAN; Bluetooth 5.1 Ports For All Your Accessories: USB 3.2 Type - C, 2 USB 3.2 Gen 1(1 Power - off Charging), USB 2.0, HDMI 2.0 with HDCP support, headphone speaker line -out jack, Ethernet(RJ - 45), DC -in for AC adapter",
        "department": 0,
        "imgRef": "/api/images/?id=AcerAspire.jpg",
        "productUrl": "/products/?id=5",
        "price": 361.07,
        "itemsInStock": 10,
        "cost": 156.99,
        "sale": false,
        "reduction": 0
    },
    {
        "id": 6,
        "name": "Layla Paperback – December 8, 2020",
        "shortDescription": "When Leeds meets Layla, he’s convinced he’ll spend the rest of his life with her―until an unexpected attack leaves Layla fighting for her life.",
        "description": "When Leeds meets Layla, he’s convinced he’ll spend the rest of his life with her―until an unexpected attack leaves Layla fighting for her life. After weeks in the hospital, Layla recovers physically, but the emotional and mental scarring has altered the woman Leeds fell in love with. In order to put their relationship back on track, Leeds whisks Layla away to the bed-and-breakfast where they first met. Once they arrive, Layla’s behavior takes a bizarre turn. And that’s just one of many inexplicable occurrences. Feeling distant from Layla, Leeds soon finds solace in Willow―another guest of the B & B with whom he forms a connection through their shared concerns.As his curiosity for Willow grows, his decision to help her find answers puts him in direct conflict with Layla’s well - being.Leeds soon realizes he has to make a choice because he can’t help both of them.But if he makes the wrong choice, it could be detrimental for all of them.",
        "department": 1,
        "imgRef": "/api/images/?id=Layla.jpg",
        "productUrl": "/products/?id=6",
        "price": 14.95,
        "itemsInStock": 10,
        "cost": 6.50,
        "sale": false,
        "reduction": 0
    },
    {
        "id": 7,
        "name": "HTML and CSS: Design and Build Websites 1st Edition ",
        "shortDescription": "A full-color introduction to the basics of HTML and CSS from the publishers of Wrox!Every day, more and more people want to learn some HTML and CSS.Joining the professional web designers and programmers are new audiences who need to know a little bit of code at work(update a content management system or e - commerce store) and those who want to make their personal blogs more attractive.Many books teaching HTML and CSS are dry and only written for those who want to become programmers, which is why this book takes an entirely new approach.",
        "description": "A full-color introduction to the basics of HTML and CSS from the publishers of Wrox! Every day, more and more people want to learn some HTML and CSS.Joining the professional web designers and programmers are new audiences who need to know a little bit of code at work(update a content management system or e - commerce store) and those who want to make their personal blogs more attractive.Many books teaching HTML and CSS are dry and only written for those who want to become programmers, which is why this book takes an entirely new approach. Introduces HTML and CSS in a way that makes them accessible to everyone―hobbyists, students, and professionals―and it’s full - color throughout Utilizes information graphics and lifestyle photography to explain the topics in a simple way that is engaging Boasts a unique structure that allows you to progress through the chapters from beginning to end or just dip into topics of particular interest at your leisure This educational book is one that you will enjoy picking up, reading, then referring back to.It will make you wish other technical topics were presented in such a simple, attractive and engaging way! This book is also available as part of a set in hardcover - Web Design with HTML, CSS, JavaScript and jQuery, 9781119038634; and in softcover - Web Design with HTML, CSS, JavaScript and jQuery, 9781118907443.",
        "department": 1,
        "imgRef": "/api/images/?id=html&css.jpg",
        "productUrl": "/products/?id=7",
        "price": 34.99,
        "itemsInStock": 10,
        "cost": 15.21,
        "sale": false,
        "reduction": 0
    },
    {
        "id": 8,
        "name": "CSS: The Definitive Guide: Visual Presentation for the Web 4th Edition ",
        "shortDescription": "If you’re a web designer or app developer interested in sophisticated page styling, improved accessibility, and saving time and effort, this book is for you. This revised edition provides a comprehensive guide to CSS implementation, along with a thorough review of the latest CSS specifications.",
        "description": "If you’re a web designer or app developer interested in sophisticated page styling, improved accessibility, and saving time and effort, this book is for you. This revised edition provides a comprehensive guide to CSS implementation, along with a thorough review of the latest CSS specifications. CSS is a constantly evolving language for describing the presentation of web content on screen, printers, speech synthesizers, screen readers, and chat windows.It is used by all browsers on all screen sizes on all types of IoT devices, including phones, computers, video games, televisions, watches, kiosks, and auto consoles.Authors Eric Meyer and Estelle Weyl show you how to improve user experience, speed development, avoid potential bugs, and add life and depth to your applications through layout, transitions and animations, borders, backgrounds, text properties, and many other tools and techniques. This guide covers:  Selectors, specificity, and the cascade Values, units, fonts, and text properties Padding, borders, outlines, and margins Colors, backgrounds, and gradients Floats and positioning tricks Flexible box layout The new Grid layout system 2D and 3D transforms, transitions, and animation Filters, blending, clipping, and masking Media and feature queries",
        "department": 1,
        "imgRef": "/api/images/?id=css-DefinitiveGuide.jpg",
        "productUrl": "/products/?id=8",
        "price": 50.99,
        "itemsInStock": 10,
        "cost": 22.17,
        "sale": true,
        "reduction": 0.30
    },
    {
        "id": 9,
        "name": "JavaScript: The Definitive Guide: Master the World's Most-Used Programming Language 7th Edition",
        "shortDescription": "JavaScript is the programming language of the web and is used by more software developers today than any other programming language.",
        "description": "JavaScript is the programming language of the web and is used by more software developers today than any other programming language. For nearly 25 years this best seller has been the go-to guide for JavaScript programmers. The seventh edition is fully updated to cover the 2020 version of JavaScript, and new chapters cover classes, modules, iterators, generators, Promises, async/await, and metaprogramming. You’ll find illuminating and engaging example code throughout. This book is for programmers who want to learn JavaScript and for web developers who want to take their understanding and mastery to the next level.It begins by explaining the JavaScript language itself, in detail, from the bottom up.It then builds on that foundation to cover the web platform and Node.js. Topics include: Types, values, variables, expressions, operators, statements, objects, and arrays Functions, classes, modules, iterators, generators, Promises, and async / await JavaScript’s standard library: data structures, regular expressions, JSON, i18n, etc. The web platform: documents, components, graphics, networking, storage, and threads Node.js: buffers, files, streams, threads, child processes, web clients, and web servers Tools and language extensions that professional JavaScript developers rely on.",
        "department": 1,
        "imgRef": "/api/images/?id=JavaScript.jpg",
        "productUrl": "/products/?id=9",
        "price": 50.99,
        "itemsInStock": 10,
        "cost": 22.17,
        "sale": false,
        "reduction": 0
    },
    {
        "id": 10,
        "name": "GoodBaby Touchless Thermometer",
        "shortDescription": "GoodBaby Touchless Thermometer for Adults,Forehead and Ear Thermometer for Fever,Infrared Magnetic Thermometer for Baby Kids Adults Surface and Room",
        "description": "Touchless Forehead Thermometer: With clinical validation and American certification, Goodbaby thermometer is reliable for its safety and accuracy.The elegant and compact thermometer is dedicated to providing accurate body temperature data and the best care for our family. Quick Reading and Easy Operation: With precise sensor probes and optimized algorithm calculation, the Infrared thermometer gives the result of the measurement data within 1 second.the thermometer can store up to 40 sets of data, you can read the temperature data record at any time to track your historical temperature changes.The magnetic cover design makes it very easy to switch between forehead mode and ear mode. 3 Backlight and Sound Indicator: Green backlight for an indication of normal temperatures with one long beep(89.6ºF ≦ T ≦ 99.5ºF), Orange backlight for an indication of a slight fever with 6 short beeps(99.7ºF ≦ T ≦ 100.4ºF), Red backlight for an indication of a high fever with 6 short beeps(100.6ºF ≦ T ≦ 109.2ºF).The beep sound can remind us of whether the body is at a normal temperature. 4 IN 1 Infrared Thermometer: With the infrared technology, a thermometer can measure the temperature of the ear and forehead.At the same time, we can use it to measure the surface temperatures of objects(milk) and rooms. Designs with Care: Thermometer for fever has 3 different age groups modes: 3 months to 6 years; 6 years to 12 years; 12 years above(Adult). The special design makes it more precise to read our body temperature. During the usage, the tone of ear mode beep sounds is lower than that of the temperature mode, which can protect our hearing.We focus on the details and the details determine success in serving our customers.We hope that our products will satisfy your needs and exceed your expectations.",
        "department": 2,
        "imgRef": "/api/images/?id=GoodBabyThermometer.jpg",
        "productUrl": "/products/?id=10",
        "price": 14.44,
        "itemsInStock": 10,
        "cost": 6.28,
        "sale": false,
        "reduction": 0
    },
    {
        "id": 11,
        "name": "Baby Playpen Portable Kids Safety Play Center",
        "shortDescription": "Baby Playpen Portable Kids Safety Play Center Yard Home Indoor Fence Anti-Fall Play Pen, Playpens for Babies, Extra Large Playard, Anti-Fall Playpen ",
        "description": "👍【✯New 2021 Regular Version】-Major upgrades the decor - friendly design can be arranged as a free - standing play yard with easy - open external double - zippers and upgraded thickened 300d oxford cloth ensure security and immense comfort!(Note: the product come with 5 extra hand grips for little ones learning to walk and hand on!) 💪【✯ EXCLUSIVE PATENTED QUICK RELEASE DESIGN】-This is the exclusive patented design of Dripex. Please kindly Beware of other fake and shoddy products.This Upgraded quick release design makes the connectors are easy to put on, but there is enough tension when all pieces are put together, to keep it tight and sturdy.Easy to disassemble and assemble(no tools required) 🏆【✯ VISIBLE MESH &SAFETY PLAY - VIEW ENCLOSURE!】-The breathable grid allows your baby to interact with mother outside the pen from multiple sides at any time. See you sitting on the couch they will continues playing and still be able to watch her cartoons, give your baby a sense of security and external double-zippers prevent the baby from accidentally climbing out and falling accidentally being injured 🥉【✯ PACK - N - PLAY ARE LITTLE CAGES】-The inside is the of the play pen is basically the size of a full size bed, 3 babies or 2 adults can be inside. Total dimensions is 79x59x27inches / 200x150x70c, with plenty of room for your child to crawls, stand, play, nap, and do whatever your child wants and your child doesn't feel caged in! And you do not have to watch your child like a hawk! You can lay down, watch tv, talk on the phone, etc... do whatever you need 💪【✯ SAFETY PET-FREE SPACE】-As with your child getting more mobile, this play pen could be a great pet free safe place for your child. This way your baby can crawl and stand without pet hair or getting knocked over.Plus you can keep all your baby's toys in one area away from the pets 👍【✯ WATERPROOF & EASY TO CLEAN】-The bottom of the play pen is made from the upgraded waterproof 300D oxford cloth.Waterproof and stain - proof to ensure milk stains and urine stains can't infiltrate, stains can be wiped and cleaned easily, so reducing bacterial growth effectively",
        "department": 2,
        "imgRef": "/api/images/?id=BabyPlaypen.jpg",
        "productUrl": "/products/?id=11",
        "price": 135.77,
        "itemsInStock": 10,
        "cost": 59.03,
        "sale": false,
        "reduction": 0
    },
    {
        "id": 12,
        "name": "Mosquito Net for Stroller",
        "shortDescription": "Mosquito Net for Stroller - 2 Pack Durable Baby Stroller Mosquito Net - Perfect Bug Net for Strollers, Bassinets, Cradles, Playards, Pack N Plays and Portable Mini Crib (Blue)",
        "description": "❣BUY MORE, PAY LESS - A bargain priced package that bundles together the 2pcs Baby Stroller Mosquito Net.Buy with Confidence, Savings with Value Pack! ❣FINER & DENSER MESH - 1mm diameter honeycomb mesh structure, make this carseat mosquito net cover more effective, sturdy and durable than traditional round mesh mosquito net.An ideal natural and high reusable solution for boys and girls to control pesky mosquitoes. ❣STRETCHABLE UP TO 60 INCH IN LENGTH - Natural unfold size: 27in by 29in. Fits for most standard jogger strollers, carriers, car seats, bassinets, carriers and cradles. ❣ODORLESS & DURABLE MATERIAL - This stroller netting is made of 100 % breathable material, allows for air flow and circulation to keep the baby comfortable and cool during use.No deet or any other chemical repellents. ❣ENJOY THE OUTDOORS WITH CONFIDENCE - Keeps the baby mosquito - bite free during walks and other outings.Four colors available, gives you more choice.ORDER NOW, WORRY FREE, with 100 % Money Back Guarantee.",
        "department": 2,
        "imgRef": "/api/images/?id=MosquitoNet.jpg",
        "productUrl": "/products/?id=12",
        "price": 6.50,
        "itemsInStock": 10,
        "cost": 2.83,
        "sale": true,
        "reduction": 0.40
    },
    {
        "id": 13,
        "name": "OXILAM Mini Size H7 LED Bulbs",
        "shortDescription": "OXILAM Mini Size H7 LED Bulbs, 6000K White Super Bright CSP Chips LED Conversion Kit Wireless, Replacement Halogen Light Bulb, Pack of 2 ",
        "description": " No Adapter Needed: This H7 LED bulb is the same design as the halogen bulb, perfectly fit into your car without any adapter/retainer, just plug and play. 2X Brighter Than Halogen: These LED bulbs provide 4,000 lumens per pair, 200 % brighter than original halogen bulbs. 6,000K white light provides a clearer illumination range.Perfect for bulb replacement. Excellent Light Source: OXILAM H7 LED bulbs feature a 1:1 halogen filament design with ultra - thin chip spacing to ensure perfect beam pattern, no dark spots or foggy light.Please make sure the LED chips face 3 and 9 o'clock after installation for perfect performance. Effective Heat Dissipation: This H7 LED bulb is CSP chip, full aviation aluminum body with hollow carved heat sink design, which can effectively dissipate heat through air convection.No fan, no noise. Anti Radio Interference: No radio interference and canbus ready, our H7 led bulbs are compatible with most vehicles.NOTE: These H7 LED bulbs not fit for 2012~2019 VW Passat, 2013~2019 VW Golf and 2017 VW Jetta, not fit for 2017 Hyundai Elantra, 2017 Hyundai Tucson, 2015 Hyundai Santa FE GLS. ",
        "department": 3,
        "imgRef": "/api/images/?id=Oxilam-H7.jpg",
        "productUrl": "/products/?id=13",
        "price": 27.19,
        "itemsInStock": 10,
        "cost": 11.82,
        "sale": false,
        "reduction": 0
    },
    {
        "id": 14,
        "name": "AstroAI Digital Tire Inflator",
        "shortDescription": "AstroAI Digital Tire Inflator with Pressure Gauge, 250 PSI Air Chuck and Compressor Accessories Heavy Duty with Rubber Hose and Quick Connect Coupler for 0.1 Display Resolution ",
        "description": "ADVANCED ACCURACY: Professionally calibrated to always return an accurate reading within 1% of the exact pressure of your tire. No more guessing! Accurately measures in a range from 3-250 PSI (0.2-17.2 Bar; 0.21-1724 Kpa; 0.2-17.5 kg/cm^2). Ideal Gifts for Men INCREASED SAFETY: Properly inflated tires provide better performance in all weather conditions, decreasing the likelihood of flats, explosions, and crashes; Increase your MPG and save money on fuel costs and tire wear ALL - IN - ONE FEATURES: The LED backlit screen features measurements in PSI, KPA, Bar, and Kg/ cm ^ 2; Includes an inflator, straight locking chuck, gauge, hose, and bleed valve, all in one unit; Compatible with both ¼” and ½” NPT air compressors outputs SUPERIOR CONSTRUCTION: Built of high quality, heavy duty stainless steel and brass components that provide lasting performance; Handle the pressure of Cars, Trucks, Motorcycles, SUVs, off road vehicles, RVs, Trailers, and more thanks to a leak-proof close flow valve in the lock-on chuck BATTERY SAVER: Auto On when pressurized air is detected, Auto Off after 20 seconds of inactivity ",
        "department": 3,
        "imgRef": "/api/images/?id=AstroAi.jpg",
        "productUrl": "/products/?id=14",
        "price": 27.50,
        "itemsInStock": 10,
        "cost": 11.96,
        "sale": false,
        "reduction": 0
    },
    {
        "id": 15,
        "name": "KEWIG Bike Phone Mount",
        "shortDescription": "KEWIG Bike Phone Mount for Motorcycle - Bike Handlebar, One Touch Lock Motorcycle Phone Mount with Aluminum Alloy Mounting Base, Tool-Free Installation Bike Phone Holder Fit 4\" - 7\" Cellphones",
        "description": "【 One - handed Operation 】 This motorcycle phone mount adopts ingenious One - click mechanical tight locking design, it ensures the safety of your cell phone attached to the bike handlebar even on a bumpy road.The bike phone holder equipped with a quick release switch, put in or take out your phone by one touch in one second with just one hand, enjoy a free and easy riding. 【 Shockproof Protection 】 This adjustable bike phone mount built-in with multiple shockproof silicone that keep your phone from scratches and vibration.Super safe and stable three-claws tightly lock and four - corners entirely wrapping design, the motorcycle phone mount holds your phone perfectly when cycling on various rocky roads. 【 Easy Installation 】 This motorcycle handlebar cell phone holder equipped upgraded handlebar mount for easier and quicker installation or removal.The extra 2 rubber ring pads make your phone fit better with handlebar, can add or remove the silicone pad according to the diameter of handlebar.Fit for handlebar diameter 22mm - 32mm. 【 Adjustable Features 】 Rotation 360 Degree bicycle cell phone mount holder and handlebar holder are connected by a spherical universal joint, can be easy to adjust the cellphone to horizontal or vertical screen.It is convenient to answer the phone, play music and GPS positioning when riding. 【 Wide Compatibility 】 This universal phone holder clamp fit for 4 - 7 inches with thickness up to 16mm(including phone case) cellphones.Compatible with iPhone 12 / 12 Pro / Max / 12 Mini / iPhone 11 / Pro / Max / XR / XS / Max / 8, Galaxy S21 / S20 / S10 / S9 +/ S9 / S8 / Note 20 and more.Suitable for various types bicycles, motorcycles, stroller, shopping cart, electric scooter, indoor treadmill and more!",
        "department": 3,
        "imgRef": "/api/images/?id=Kewig.jpg",
        "productUrl": "/products/?id=15",
        "price": 15.89,
        "itemsInStock": 10,
        "cost": 6.91,
        "sale": false,
        "reduction": 0
    },
    {
        "id": 16,
        "name": "MOTOPOWER MP69033",
        "shortDescription": "MOTOPOWER MP69033 Car OBD2 Scanner Code Reader Engine Fault Code Reader Scanner CAN Diagnostic Scan Tool for All OBD II Protocol Cars Since 1996 ",
        "description": " ✅【Multi-Functions】- Practical Multi-Functions OBD2 code reader features built-in OBD2 DTC lookup library, which help you to determine the cause of the engine light, read code, erase code, view freeze frame, I/M ready, vehicle information, data flow, real-time curve, get vehicle speed information, calculate load value, engine coolant temperature, get engine speed. ✅【Wide Capability】-Supports 9 protocols compatible with most 1996 US - Based, 2000 EU - Based and Asian cars, and newer OBD II & CAN domestic or import vehicles.Supports 6 languages - English, German, Dutch, Spanish,                     French, Italian. ✅【LCD Display】-Designed with a clear display LCD screen(128 x 64 pixels) - white backlight and contrast adjustment.No need any battery or charger, OBD reader gets the power directly from your vehicle through the OBDII Data Link Connector. ✅【Compact Design】-Car diagnostic scanner is equipped with a 2.5 feet long cable and made of a very thick flexible insulator.There are 6 buttons on OBD2 Scanner:scroll up / down, enter / exit and buttons that quick query VIN vehicle number & the DTC fault code. ✅【ABS / Airbag codes NOT Supported】-It is able to read and clear check engine information which is part of OBDII syste, but it cannot work with non - OBDII systems, including ABS / Airbag / Oil Service Light, etc. ✅【Screen Protecting Film】-There’s a transparent screen protecting film on the screen surface.If any scratches on the fil, just tear off the screen protecting film.If any more problem on the screen, just contact our customer service for replacement directly. ✅【Connection Guide】-Plug the scanner into the OBDII port on your car, turn on the ignition and then press the OK button to make the connection.To view the live data, please start the engine.If connection failure, please contact motopower directly for assistance. ",
        "department": 3,
        "imgRef": "/api/images/?id=Motopower.jpg",
        "productUrl": "/products/?id=16",
        "price": 26.09,
        "itemsInStock": 10,
        "cost": 11.34,
        "sale": true,
        "reduction": 0.20
    }
]